app/controllers/merchants_controller.rb

UPDATE "merchants" SET "name" = ?, "description" = ?, "address1" = ?, "address2" = ?, "city" = ?, "postcode" = ?, "country" = ?, "website" = ?, "phone_number" = ?, "google_url" = ?, "google_place_id" = ?, "google_rating" = ?, "google_num_reviews" = ?, "google_price_level" = ?, "lat" = ?, "lng" = ?, "updated_at" = ? WHERE "merchants"."id" = ?
---
	def update
		@merchant = current_user.merchant

		if @merchant.update_attributes(merchant_params)